HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_can.c
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-03-19     ASUS         the first version
 */

#include <rtthread.h>

#include "drv_can.h"
#include "CAN_config.h"
#include "cy_gpio.h"
#include "cy_sysclk.h"
#include "cycfg_peripheral_clocks.h"
#include "cycfg_system.h"
#include "gpio_pse84_bga_220.h"

#ifdef BSP_USING_CAN

#ifndef IFX_CAN_FORCE_CLASSIC
#define IFX_CAN_FORCE_CLASSIC 1
#endif

#ifndef IFX_CAN_TX_WAIT_MS
#define IFX_CAN_TX_WAIT_MS 20U
#endif

#ifndef IFX_CAN_RX_DRAIN_LIMIT
#define IFX_CAN_RX_DRAIN_LIMIT 16U
#endif

#ifndef IFX_CAN_ENABLE_NVIC
#define IFX_CAN_ENABLE_NVIC 0
#endif

enum
{
#ifdef BSP_USING_CANFD0
    CANFD0_INDEX,
#endif
};

static struct ifx_can_config can_config[] =
{
#ifdef BSP_USING_CANFD0
    CANFD0_CONFIG,
#endif
};

#if !defined(BSP_USING_CANFD0)
#error "BSP_USING_CAN is enabled, but no CANFD instance is selected."
#endif

static struct ifx_can can_obj[sizeof(can_config) / sizeof(can_config[0])] = {0};
static rt_bool_t g_canfd0_hw_prepared = RT_FALSE;
static rt_bool_t g_canfd0_mmio_prepared = RT_FALSE;
static rt_bool_t g_can_direct_ready = RT_FALSE;
static rt_uint8_t g_can_direct_tx_index = 0U;

static const rt_uint8_t can_dlc_to_len_table[16] =
{
    0, 1, 2, 3, 4, 5, 6, 7,
    8, 12, 16, 20, 24, 32, 48, 64,
};

static rt_uint8_t can_len_to_dlc(rt_uint8_t len, rt_bool_t fd_frame)
{
    if (!fd_frame)
    {
        return (len > 8U) ? 8U : len;
    }

    if (len <= 8U)
    {
        return len;
    }
    if (len <= 12U)
    {
        return 9U;
    }
    if (len <= 16U)
    {
        return 10U;
    }
    if (len <= 20U)
    {
        return 11U;
    }
    if (len <= 24U)
    {
        return 12U;
    }
    if (len <= 32U)
    {
        return 13U;
    }
    if (len <= 48U)
    {
        return 14U;
    }

    return 15U;
}

static rt_uint8_t can_dlc_to_len(rt_uint8_t dlc)
{
    return can_dlc_to_len_table[(dlc < 16U) ? dlc : 15U];
}

static void ifx_canfd0_prepare_hw(void)
{
#ifdef BSP_USING_CANFD0
    cy_stc_gpio_pin_config_t rx_pin_cfg;
    cy_stc_gpio_pin_config_t tx_pin_cfg;

    if (g_canfd0_hw_prepared)
    {
        return;
    }

    if (!g_canfd0_mmio_prepared)
    {
        rt_kprintf("[drv_can] mmio step1 init hsiom\n");
        Cy_SysClk_PeriGroupSlaveInit(
            CY_MMIO_HSIOM_PERI_NR,
            CY_MMIO_HSIOM_GROUP_NR,
            CY_MMIO_HSIOM_SLAVE_NR,
            CY_MMIO_HSIOM_CLK_HF_NR);

        rt_kprintf("[drv_can] mmio step2 init gpio\n");
        Cy_SysClk_PeriGroupSlaveInit(
            CY_MMIO_GPIO_PERI_NR,
            CY_MMIO_GPIO_GROUP_NR,
            CY_MMIO_GPIO_SLAVE_NR,
            CY_MMIO_GPIO_CLK_HF_NR);

        rt_kprintf("[drv_can] mmio step3 init canfd0\n");
        Cy_SysClk_PeriGroupSlaveInit(
            CY_MMIO_CANFD0_PERI_NR,
            CY_MMIO_CANFD0_GROUP_NR,
            CY_MMIO_CANFD0_SLAVE_NR,
            CY_MMIO_CANFD0_CLK_HF_NR);

        g_canfd0_mmio_prepared = RT_TRUE;
        rt_kprintf("[drv_can] mmio step4 done\n");
    }

    rt_kprintf("[drv_can] hw prep step1 assign pclk\n");
    Cy_SysClk_PeriPclkAssignDivider(PCLK_CANFD0_CLOCK_CAN_EN0, CY_SYSCLK_DIV_8_BIT, 4U);
    Cy_SysClk_PeriPclkAssignDivider(PCLK_CANFD0_CLOCK_CAN_EN1, CY_SYSCLK_DIV_8_BIT, 4U);
    Cy_SysClk_PeriPclkSetDivider(PCLK_CANFD0_CLOCK_CAN_EN0, CY_SYSCLK_DIV_8_BIT, 4U, 4U);
    Cy_SysClk_PeriPclkSetDivider(PCLK_CANFD0_CLOCK_CAN_EN1, CY_SYSCLK_DIV_8_BIT, 4U, 4U);
    Cy_SysClk_PeriPclkEnableDivider(PCLK_CANFD0_CLOCK_CAN_EN0, CY_SYSCLK_DIV_8_BIT, 4U);
    Cy_SysClk_PeriPclkEnableDivider(PCLK_CANFD0_CLOCK_CAN_EN1, CY_SYSCLK_DIV_8_BIT, 4U);

    rt_kprintf("[drv_can] hw prep step2 config p16.0 rx\n");
    rx_pin_cfg.outVal = 1U;
    rx_pin_cfg.driveMode = CY_GPIO_DM_HIGHZ;
    rx_pin_cfg.hsiom = P16_0_CANFD0_TTCAN_RX0;
    rx_pin_cfg.intEdge = CY_GPIO_INTR_DISABLE;
    rx_pin_cfg.intMask = 0UL;
    rx_pin_cfg.vtrip = CY_GPIO_VTRIP_CMOS;
    rx_pin_cfg.slewRate = CY_GPIO_SLEW_FAST;
    rx_pin_cfg.driveSel = CY_GPIO_DRIVE_1_2;
    rx_pin_cfg.vregEn = 0UL;
    rx_pin_cfg.ibufMode = 0UL;
    rx_pin_cfg.vtripSel = 0UL;
    rx_pin_cfg.vrefSel = 0UL;
    rx_pin_cfg.vohSel = 0UL;
    rx_pin_cfg.pullUpRes = CY_GPIO_PULLUP_RES_DISABLE;
    rx_pin_cfg.nonSec = 1UL;
    Cy_GPIO_Pin_Init(P16_0_PORT, P16_0_PIN, &rx_pin_cfg);

    rt_kprintf("[drv_can] hw prep step3 config p16.1 tx\n");
    tx_pin_cfg.outVal = 1U;
    tx_pin_cfg.driveMode = CY_GPIO_DM_STRONG_IN_OFF;
    tx_pin_cfg.hsiom = P16_1_CANFD0_TTCAN_TX0;
    tx_pin_cfg.intEdge = CY_GPIO_INTR_DISABLE;
    tx_pin_cfg.intMask = 0UL;
    tx_pin_cfg.vtrip = CY_GPIO_VTRIP_CMOS;
    tx_pin_cfg.slewRate = CY_GPIO_SLEW_FAST;
    tx_pin_cfg.driveSel = CY_GPIO_DRIVE_1_2;
    tx_pin_cfg.vregEn = 0UL;
    tx_pin_cfg.ibufMode = 0UL;
    tx_pin_cfg.vtripSel = 0UL;
    tx_pin_cfg.vrefSel = 0UL;
    tx_pin_cfg.vohSel = 0UL;
    tx_pin_cfg.pullUpRes = CY_GPIO_PULLUP_RES_DISABLE;
    tx_pin_cfg.nonSec = 1UL;
    Cy_GPIO_Pin_Init(P16_1_PORT, P16_1_PIN, &tx_pin_cfg);

    g_canfd0_hw_prepared = RT_TRUE;
    rt_kprintf("[drv_can] hw prep step4 done\n");
#endif
}

static void can_apply_mode(struct ifx_can *can, rt_uint32_t mode)
{
    cy_stc_canfd_test_mode_t test_mode = CY_CANFD_TEST_MODE_DISABLE;

    if (mode == RT_CAN_MODE_LISTEN)
    {
        test_mode = CY_CANFD_TEST_MODE_BUS_MONITORING;
    }
    else if ((mode == RT_CAN_MODE_LOOPBACK) || (mode == RT_CAN_MODE_LOOPBACKANLISTEN))
    {
        test_mode = CY_CANFD_TEST_MODE_INTERNAL_LOOP_BACK;
    }

    if (Cy_CANFD_ConfigChangesEnable(can->config->can_x, can->config->channel) == CY_CANFD_SUCCESS)
    {
        Cy_CANFD_TestModeConfig(can->config->can_x, can->config->channel, test_mode);
        (void)Cy_CANFD_ConfigChangesDisable(can->config->can_x, can->config->channel);
    }
}

static void can_report_tx_done(struct ifx_can *can)
{
    rt_uint32_t idx;

    for (idx = 0; idx < 32U; idx++)
    {
        rt_uint32_t mask = (1UL << idx);

        if ((can->tx_pending_mask & mask) == 0U)
        {
            continue;
        }

        switch (Cy_CANFD_GetTxBufferStatus(can->config->can_x, can->config->channel, (uint8_t)idx))
        {
        case CY_CANFD_TX_BUFFER_PENDING:
            break;

        case CY_CANFD_TX_BUFFER_CANCEL_FINISHED:
            can->tx_pending_mask &= ~mask;
            rt_hw_can_isr(&can->device, RT_CAN_EVENT_TX_FAIL | (idx << 8));
            break;

        default:
            can->tx_pending_mask &= ~mask;
            rt_hw_can_isr(&can->device, RT_CAN_EVENT_TX_DONE | (idx << 8));
            break;
        }
    }
}

static void can_wait_tx_done_or_fail(struct ifx_can *can, rt_uint8_t idx)
{
    rt_uint32_t mask = (1UL << idx);
    rt_uint32_t waited_ms;

