HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_can.c
    for (waited_ms = 0U; waited_ms <= IFX_CAN_TX_WAIT_MS; waited_ms++)
    {
        can_report_tx_done(can);
        if ((can->tx_pending_mask & mask) == 0U)
        {
            return;
        }

        if (waited_ms < IFX_CAN_TX_WAIT_MS)
        {
            rt_thread_mdelay(1);
        }
    }

    can->tx_pending_mask &= ~mask;
    rt_kprintf("[drv_can] tx timeout box=%u\n", (unsigned int)idx);
    rt_hw_can_isr(&can->device, RT_CAN_EVENT_TX_FAIL | ((rt_uint32_t)idx << 8));
}

static void can_report_rx_fifo(struct ifx_can *can, rt_uint32_t fifo)
{
    rt_uint32_t count;

    for (count = 0U; count < IFX_CAN_RX_DRAIN_LIMIT; count++)
    {
        rt_uint32_t fill;

        if (fifo == CY_CANFD_RX_FIFO0)
        {
            fill = _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0FL,
                            CANFD_RXF0S(can->config->can_x, can->config->channel));
        }
        else
        {
            fill = _FLD2VAL(CANFD_CH_M_TTCAN_RXF1S_F1FL,
                            CANFD_RXF1S(can->config->can_x, can->config->channel));
        }

        if (fill == 0U)
        {
            break;
        }

        rt_hw_can_isr(&can->device, RT_CAN_EVENT_RX_IND | (fifo << 8));
    }
}

static void can_irq_handler(struct ifx_can *can)
{
    rt_uint32_t status;

    status = Cy_CANFD_GetInterruptStatus(can->config->can_x, can->config->channel);
    if (status == 0U)
    {
        return;
    }

    Cy_CANFD_ClearInterrupt(can->config->can_x, can->config->channel, status);

    if ((status & CY_CANFD_RX_FIFO_0_NEW_MESSAGE) != 0U)
    {
        can_report_rx_fifo(can, CY_CANFD_RX_FIFO0);
    }

    if ((status & CY_CANFD_RX_FIFO_1_NEW_MESSAGE) != 0U)
    {
        can_report_rx_fifo(can, CY_CANFD_RX_FIFO1);
    }

    if ((status & (CY_CANFD_RX_FIFO_0_MSG_LOST | CY_CANFD_RX_FIFO_1_MSG_LOST)) != 0U)
    {
        rt_hw_can_isr(&can->device, RT_CAN_EVENT_RXOF_IND);
    }

    if ((status & (CY_CANFD_TRANSMISSION_COMPLETE | CY_CANFD_TRANSMISSION_CANCEL_FINISHED)) != 0U)
    {
        can_report_tx_done(can);
    }
}

#ifdef BSP_USING_CANFD0
void canfd0_isr_callback(void)
{
    rt_interrupt_enter();
    can_irq_handler(&can_obj[CANFD0_INDEX]);
    rt_interrupt_leave();
}
#endif

static rt_err_t ifx_can_configure(struct rt_can_device *device, struct can_configure *cfg)
{
    cy_en_canfd_status_t result;
    struct ifx_can *can;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    can = (struct ifx_can *)device->parent.user_data;
    RT_ASSERT(can != RT_NULL);

    ifx_canfd0_prepare_hw();
    rt_kprintf("[drv_can] configure step1 base=0x%08lx ch=%lu mram=0x%08lx\n",
               (unsigned long)can->config->can_x,
               (unsigned long)can->config->channel,
               (unsigned long)can->config->canfd_config->messageRAMaddress);
    rt_kprintf("[drv_can] configure step1.1 ctl=0x%08lx status=0x%08lx\n",
               (unsigned long)CANFD_CTL(can->config->can_x),
               (unsigned long)CANFD_STATUS(can->config->can_x));
    rt_kprintf("[drv_can] configure step2 enable\n");
    Cy_CANFD_Enable(can->config->can_x, (1UL << can->config->channel));
    rt_kprintf("[drv_can] configure step3 init\n");
    result = Cy_CANFD_Init(can->config->can_x, can->config->channel, can->config->canfd_config, &can->context);
    rt_kprintf("[drv_can] configure step4 init ret=%d\n", result);
    if (result != CY_CANFD_SUCCESS)
    {
        return -RT_ERROR;
    }

    can_apply_mode(can, cfg->mode);
    rt_kprintf("[drv_can] configure step5 mode=%lu\n", (unsigned long)cfg->mode);
    can->irq_mask = 0U;
    can->tx_pending_mask = 0U;

    return RT_EOK;
}

static rt_err_t ifx_can_control(struct rt_can_device *device, int cmd, void *arg)
{
    struct ifx_can *can;
    rt_ubase_t flag;

    RT_ASSERT(device != RT_NULL);

    can = (struct ifx_can *)device->parent.user_data;
    RT_ASSERT(can != RT_NULL);

    switch (cmd)
    {
    case RT_DEVICE_CTRL_SET_INT:
        flag = (rt_ubase_t)arg;
        rt_kprintf("[drv_can] set_int step1 flag=0x%08lx\n", (unsigned long)flag);

        if ((flag & RT_DEVICE_FLAG_INT_RX) != 0U)
        {
            can->irq_mask |= (CY_CANFD_RX_FIFO_0_NEW_MESSAGE | CY_CANFD_RX_FIFO_1_NEW_MESSAGE |
                              CY_CANFD_RX_FIFO_0_MSG_LOST | CY_CANFD_RX_FIFO_1_MSG_LOST);
        }

        if ((flag & RT_DEVICE_FLAG_INT_TX) != 0U)
        {
            can->irq_mask |= (CY_CANFD_TRANSMISSION_COMPLETE | CY_CANFD_TRANSMISSION_CANCEL_FINISHED);
        }

        if ((flag & RT_DEVICE_CAN_INT_ERR) != 0U)
        {
            rt_kprintf("[drv_can] set_int skip err mask during bring-up\n");
        }

        rt_kprintf("[drv_can] set_int step2 mask=0x%08lx\n", (unsigned long)can->irq_mask);
        Cy_CANFD_ClearInterrupt(can->config->can_x,
                                can->config->channel,
                                0xFFFFFFFFUL);
        NVIC_ClearPendingIRQ(can->config->intrSrc);
#if IFX_CAN_ENABLE_NVIC
        Cy_CANFD_SetInterruptMask(can->config->can_x, can->config->channel, can->irq_mask);
        rt_kprintf("[drv_can] set_int step3 line enable\n");
        Cy_CANFD_EnableInterruptLine(can->config->can_x, can->config->channel, CY_CANFD_INTERRUPT_LINE_0_EN);
        rt_kprintf("[drv_can] set_int step4 sysint init irqn=%ld\n", (long)can->config->intrSrc);
        Cy_SysInt_Init(can->config->irq_cfg, can->config->userIsr);
        rt_kprintf("[drv_can] set_int step5 nvic enable\n");
        NVIC_EnableIRQ(can->config->intrSrc);
        rt_kprintf("[drv_can] set_int step6 done\n");
#else
        Cy_CANFD_SetInterruptMask(can->config->can_x, can->config->channel, 0U);
        Cy_CANFD_EnableInterruptLine(can->config->can_x, can->config->channel, 0U);
        NVIC_DisableIRQ(can->config->intrSrc);
        rt_kprintf("[drv_can] set_int polling mode nvic disabled\n");
#endif
        return RT_EOK;

    case RT_DEVICE_CTRL_CLR_INT:
        flag = (rt_ubase_t)arg;

        if ((flag & RT_DEVICE_FLAG_INT_RX) != 0U)
        {
            can->irq_mask &= ~(CY_CANFD_RX_FIFO_0_NEW_MESSAGE | CY_CANFD_RX_FIFO_1_NEW_MESSAGE |
                               CY_CANFD_RX_FIFO_0_MSG_LOST | CY_CANFD_RX_FIFO_1_MSG_LOST);
        }

        if ((flag & RT_DEVICE_FLAG_INT_TX) != 0U)
        {
            can->irq_mask &= ~(CY_CANFD_TRANSMISSION_COMPLETE | CY_CANFD_TRANSMISSION_CANCEL_FINISHED);
        }

        if ((flag & RT_DEVICE_CAN_INT_ERR) != 0U)
        {
            can->irq_mask &= ~(CY_CANFD_WARNING_STATUS | CY_CANFD_ERROR_PASSIVE | CY_CANFD_BUS_OFF_STATUS);
        }

        Cy_CANFD_SetInterruptMask(can->config->can_x, can->config->channel, can->irq_mask);
        if (can->irq_mask == 0U)
        {
            NVIC_DisableIRQ(can->config->intrSrc);
        }
        return RT_EOK;

    case RT_CAN_CMD_SET_FILTER:
        return RT_EOK;

    case IFX_CAN_CMD_POLL_RX:
        can_report_rx_fifo(can, CY_CANFD_RX_FIFO0);
        can_report_rx_fifo(can, CY_CANFD_RX_FIFO1);
        can_report_tx_done(can);
        return RT_EOK;

    default:
        return RT_EOK;
    }
}

