HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_can.c
static rt_ssize_t ifx_can_sendmsg(struct rt_can_device *device, const void *buf, rt_uint32_t boxno)
{
    cy_en_canfd_status_t result;
    const struct rt_can_msg *msg;
    struct ifx_can *can;
    rt_uint8_t dlc;
    rt_uint8_t len;
    rt_bool_t is_fd;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    msg = (const struct rt_can_msg *)buf;
    can = (struct ifx_can *)device->parent.user_data;
    RT_ASSERT(can != RT_NULL);

#if defined(RT_CAN_USING_CANFD)
    is_fd = IFX_CAN_FORCE_CLASSIC ? RT_FALSE : ((msg->fd_frame != 0U) ? RT_TRUE : RT_FALSE);
#else
    is_fd = RT_FALSE;
#endif

    dlc = can_len_to_dlc((rt_uint8_t)msg->len, is_fd);
    len = can_dlc_to_len(dlc);

    can->tx_t0.id = msg->id;
    can->tx_t0.rtr = (msg->rtr != 0U) ? CY_CANFD_RTR_REMOTE_FRAME : CY_CANFD_RTR_DATA_FRAME;
    can->tx_t0.xtd = (msg->ide != 0U) ? CY_CANFD_XTD_EXTENDED_ID : CY_CANFD_XTD_STANDARD_ID;
    can->tx_t0.esi = CY_CANFD_ESI_ERROR_ACTIVE;

    can->tx_t1.dlc = dlc;
#if IFX_CAN_FORCE_CLASSIC
    can->tx_t1.brs = false;
    can->tx_t1.fdf = CY_CANFD_FDF_STANDARD_FRAME;
#elif defined(RT_CAN_USING_CANFD)
    can->tx_t1.brs = (msg->brs != 0U) ? true : false;
    can->tx_t1.fdf = is_fd ? CY_CANFD_FDF_CAN_FD_FRAME : CY_CANFD_FDF_STANDARD_FRAME;
#else
    can->tx_t1.brs = false;
    can->tx_t1.fdf = CY_CANFD_FDF_STANDARD_FRAME;
#endif
    can->tx_t1.efc = false;
    can->tx_t1.mm = 0U;

    rt_memset(can->tx_data, 0, sizeof(can->tx_data));
    if ((msg->rtr == RT_CAN_DTR) && (len > 0U))
    {
        rt_memcpy(can->tx_data, msg->data, len);
    }

    can->tx_buffer.t0_f = &can->tx_t0;
    can->tx_buffer.t1_f = &can->tx_t1;
    can->tx_buffer.data_area_f = can->tx_data;

    result = Cy_CANFD_UpdateAndTransmitMsgBuffer(can->config->can_x,
                                                  can->config->channel,
                                                  &can->tx_buffer,
                                                  (uint8_t)boxno,
                                                  &can->context);
    if (result != CY_CANFD_SUCCESS)
    {
        return -RT_ERROR;
    }

    if (boxno < 32U)
    {
        can->tx_pending_mask |= (1UL << boxno);
        can_wait_tx_done_or_fail(can, (rt_uint8_t)boxno);
    }

    return RT_EOK;
}

static rt_ssize_t ifx_can_recvmsg(struct rt_can_device *device, void *buf, rt_uint32_t boxno)
{
    cy_en_canfd_status_t result;
    struct rt_can_msg *msg;
    struct ifx_can *can;
    rt_uint8_t dlc;
    rt_uint8_t len;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    msg = (struct rt_can_msg *)buf;
    can = (struct ifx_can *)device->parent.user_data;
    RT_ASSERT(can != RT_NULL);

    can->rx_buffer.r0_f = &can->rx_r0;
    can->rx_buffer.r1_f = &can->rx_r1;
    can->rx_buffer.data_area_f = can->rx_data;
    rt_memset(can->rx_data, 0, sizeof(can->rx_data));

    result = Cy_CANFD_ExtractMsgFromRXBuffer(can->config->can_x,
                                             can->config->channel,
                                             true,
                                             (uint8_t)boxno,
                                             &can->rx_buffer,
                                             &can->context);
    if (result != CY_CANFD_SUCCESS)
    {
        return -RT_ERROR;
    }

    msg->id = can->rx_r0.id;
    msg->ide = (can->rx_r0.xtd == CY_CANFD_XTD_EXTENDED_ID) ? 1U : 0U;
    msg->rtr = (can->rx_r0.rtr == CY_CANFD_RTR_REMOTE_FRAME) ? 1U : 0U;
    msg->hdr_index = (rt_int8_t)can->rx_r1.fidx;

    dlc = (rt_uint8_t)can->rx_r1.dlc;
    len = can_dlc_to_len(dlc);
    msg->len = len;
    msg->rxfifo = boxno;
#if defined(RT_CAN_USING_CANFD)
#if IFX_CAN_FORCE_CLASSIC
    msg->fd_frame = 0U;
    msg->brs = 0U;
#else
    msg->fd_frame = (can->rx_r1.fdf == CY_CANFD_FDF_CAN_FD_FRAME) ? 1U : 0U;
    msg->brs = can->rx_r1.brs ? 1U : 0U;
#endif
#endif

    if (len > 0U)
    {
        rt_memcpy(msg->data, can->rx_data, len);
    }

    return RT_EOK;
}

rt_err_t ifx_can_direct_init(void)
{
#ifdef BSP_USING_CANFD0
    cy_en_canfd_status_t result;
    struct ifx_can *can = &can_obj[CANFD0_INDEX];

    can->config = &can_config[CANFD0_INDEX];

    ifx_canfd0_prepare_hw();
    Cy_CANFD_Enable(can->config->can_x, (1UL << can->config->channel));
    result = Cy_CANFD_Init(can->config->can_x,
                           can->config->channel,
                           can->config->canfd_config,
                           &can->context);
    if (result != CY_CANFD_SUCCESS)
    {
        rt_kprintf("[drv_can] direct init failed ret=%d\n", result);
        g_can_direct_ready = RT_FALSE;
        return -RT_ERROR;
    }

    (void)Cy_CANFD_ClearInterrupt(can->config->can_x, can->config->channel, 0xFFFFFFFFUL);
    Cy_CANFD_SetInterruptMask(can->config->can_x, can->config->channel, 0U);
    Cy_CANFD_EnableInterruptLine(can->config->can_x, can->config->channel, 0U);
    NVIC_ClearPendingIRQ(can->config->intrSrc);
    NVIC_DisableIRQ(can->config->intrSrc);

    can_apply_mode(can, RT_CAN_MODE_NORMAL);
    can->irq_mask = 0U;
    can->tx_pending_mask = 0U;
    g_can_direct_tx_index = 0U;
    g_can_direct_ready = RT_TRUE;

    rt_kprintf("[drv_can] direct ready pclk=%lu nbtp=0x%08lx rxf0s=0x%08lx\n",
               (unsigned long)Cy_SysClk_PeriPclkGetFrequency(PCLK_CANFD0_CLOCK_CAN_EN0,
                                                              CY_SYSCLK_DIV_8_BIT,
                                                              4U),
               (unsigned long)CANFD_NBTP(can->config->can_x, can->config->channel),
               (unsigned long)CANFD_RXF0S(can->config->can_x, can->config->channel));
    return RT_EOK;
#else
    return -RT_ERROR;
#endif
}

rt_err_t ifx_can_direct_send(const struct rt_can_msg *msg)
{
#ifdef BSP_USING_CANFD0
    cy_en_canfd_status_t result;
    struct ifx_can *can = &can_obj[CANFD0_INDEX];
    rt_uint8_t dlc;
    rt_uint8_t len;
    rt_uint8_t tx_index;
    rt_uint32_t waited_ms;
    rt_bool_t is_fd;

    if ((msg == RT_NULL) || (!g_can_direct_ready))
    {
        return -RT_ERROR;
    }

#if defined(RT_CAN_USING_CANFD)
    is_fd = IFX_CAN_FORCE_CLASSIC ? RT_FALSE : ((msg->fd_frame != 0U) ? RT_TRUE : RT_FALSE);
#else
    is_fd = RT_FALSE;
#endif

    dlc = can_len_to_dlc((rt_uint8_t)msg->len, is_fd);
    len = can_dlc_to_len(dlc);

    can->tx_t0.id = msg->id;
    can->tx_t0.rtr = (msg->rtr != 0U) ? CY_CANFD_RTR_REMOTE_FRAME : CY_CANFD_RTR_DATA_FRAME;
    can->tx_t0.xtd = (msg->ide != 0U) ? CY_CANFD_XTD_EXTENDED_ID : CY_CANFD_XTD_STANDARD_ID;
    can->tx_t0.esi = CY_CANFD_ESI_ERROR_ACTIVE;

    can->tx_t1.dlc = dlc;
#if IFX_CAN_FORCE_CLASSIC
    can->tx_t1.brs = false;
    can->tx_t1.fdf = CY_CANFD_FDF_STANDARD_FRAME;
#elif defined(RT_CAN_USING_CANFD)
    can->tx_t1.brs = (msg->brs != 0U) ? true : false;
    can->tx_t1.fdf = is_fd ? CY_CANFD_FDF_CAN_FD_FRAME : CY_CANFD_FDF_STANDARD_FRAME;
#else
    can->tx_t1.brs = false;
    can->tx_t1.fdf = CY_CANFD_FDF_STANDARD_FRAME;
#endif
    can->tx_t1.efc = false;
    can->tx_t1.mm = 0U;

