HalloYang06/PSOC_E84_robot/libraries/HAL_Drivers/drv_can.c
    rt_memset(can->tx_data, 0, sizeof(can->tx_data));
    if ((msg->rtr == RT_CAN_DTR) && (len > 0U))
    {
        rt_memcpy(can->tx_data, msg->data, len);
    }

    can->tx_buffer.t0_f = &can->tx_t0;
    can->tx_buffer.t1_f = &can->tx_t1;
    can->tx_buffer.data_area_f = can->tx_data;

    tx_index = g_can_direct_tx_index++ % BSP_CANFD0_TX_BUFFER_COUNT;
    result = Cy_CANFD_UpdateAndTransmitMsgBuffer(can->config->can_x,
                                                 can->config->channel,
                                                 &can->tx_buffer,
                                                 tx_index,
                                                 &can->context);
    if (result != CY_CANFD_SUCCESS)
    {
        rt_kprintf("[drv_can] direct send failed box=%u ret=%d\n",
                   (unsigned int)tx_index,
                   result);
        return -RT_ERROR;
    }

    for (waited_ms = 0U; waited_ms <= IFX_CAN_TX_WAIT_MS; waited_ms++)
    {
        if (Cy_CANFD_GetTxBufferStatus(can->config->can_x,
                                       can->config->channel,
                                       tx_index) != CY_CANFD_TX_BUFFER_PENDING)
        {
            return RT_EOK;
        }

        if (waited_ms < IFX_CAN_TX_WAIT_MS)
        {
            rt_thread_mdelay(1);
        }
    }

    rt_kprintf("[drv_can] direct tx pending box=%u\n", (unsigned int)tx_index);
    return -RT_ETIMEOUT;
#else
    return -RT_ERROR;
#endif
}

rt_ssize_t ifx_can_direct_recv(struct rt_can_msg *msg)
{
#ifdef BSP_USING_CANFD0
    cy_en_canfd_status_t result;
    struct ifx_can *can = &can_obj[CANFD0_INDEX];
    rt_uint32_t f0s;
    rt_uint32_t fill;
    rt_uint8_t dlc;
    rt_uint8_t len;

    if ((msg == RT_NULL) || (!g_can_direct_ready))
    {
        return -RT_ERROR;
    }

    f0s = CANFD_RXF0S(can->config->can_x, can->config->channel);
    fill = _FLD2VAL(CANFD_CH_M_TTCAN_RXF0S_F0FL, f0s);
    if (fill == 0U)
    {
        return 0;
    }

    can->rx_buffer.r0_f = &can->rx_r0;
    can->rx_buffer.r1_f = &can->rx_r1;
    can->rx_buffer.data_area_f = can->rx_data;
    rt_memset(can->rx_data, 0, sizeof(can->rx_data));
    rt_memset(msg, 0, sizeof(*msg));

    result = Cy_CANFD_ExtractMsgFromRXBuffer(can->config->can_x,
                                             can->config->channel,
                                             true,
                                             CY_CANFD_RX_FIFO0,
                                             &can->rx_buffer,
                                             &can->context);
    if (result != CY_CANFD_SUCCESS)
    {
        rt_kprintf("[drv_can] direct recv failed ret=%d f0s=0x%08lx\n",
                   result,
                   (unsigned long)f0s);
        return -RT_ERROR;
    }

    msg->id = can->rx_r0.id;
    msg->ide = (can->rx_r0.xtd == CY_CANFD_XTD_EXTENDED_ID) ? 1U : 0U;
    msg->rtr = (can->rx_r0.rtr == CY_CANFD_RTR_REMOTE_FRAME) ? 1U : 0U;
    msg->hdr_index = (rt_int8_t)can->rx_r1.fidx;
    msg->rxfifo = CY_CANFD_RX_FIFO0;

    dlc = (rt_uint8_t)can->rx_r1.dlc;
    len = can_dlc_to_len(dlc);
    msg->len = len;
#if defined(RT_CAN_USING_CANFD)
    msg->fd_frame = 0U;
    msg->brs = 0U;
#endif
    if (len > 0U)
    {
        rt_memcpy(msg->data, can->rx_data, len);
    }

    return (rt_ssize_t)sizeof(*msg);
#else
    return -RT_ERROR;
#endif
}

static const struct rt_can_ops ifx_can_ops =
{
    .configure = ifx_can_configure,
    .control = ifx_can_control,
    .sendmsg = ifx_can_sendmsg,
    .recvmsg = ifx_can_recvmsg,
};

int rt_hw_can_init(void)
{
    rt_err_t result;
    rt_size_t i;
    struct can_configure config = CANDEFAULTCONFIG;

#if defined(RT_CAN_USING_CANFD)
#if IFX_CAN_FORCE_CLASSIC
    config.enable_canfd = 0;
#else
    config.enable_canfd = 1;
#endif
    config.baud_rate_fd = CAN1MBaud;
#endif
    config.baud_rate = CAN1MBaud;
    config.ticks = rt_tick_from_millisecond(50);
    if (config.ticks == 0U)
    {
        config.ticks = 1U;
    }
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 14;
#endif

    for (i = 0; i < (sizeof(can_obj) / sizeof(can_obj[0])); i++)
    {
        can_obj[i].config = &can_config[i];
        can_obj[i].device.config = config;

        result = rt_hw_can_register(&can_obj[i].device,
                                    can_obj[i].config->name,
                                    &ifx_can_ops,
                                    &can_obj[i]);
        if (result != RT_EOK)
        {
            return result;
        }
    }

    return RT_EOK;
}
INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* BSP_USING_CAN */

